package com.shengrui.huilian.main_region.select_city;


import com.shengrui.huilian.main_region.select_city.widget.ContactItemInterface;
import com.shengrui.huilian.main_region.select_city.widget.pinyin.PinYin;

import org.json.JSONArray;
import org.json.JSONException;
import org.json.JSONObject;

import java.util.ArrayList;
import java.util.List;

/**
 * 357个中国城市
 * @author ck
 * @since 2014年2月7日 16:20:32
 */
public class CityData
{
	static String cityJson = "{'cities':['北京朝阳区','北京海淀区','北京通州区','北京房山区','北京丰台区','北京昌平区','北京大兴区','北京顺义区','北京西城区','北京延庆县', " +
			"'北京石景山区','北京宣武区','北京怀柔区','北京崇文区','北京密云县','北京东城区','北京门头沟区','北京平谷区','天津和平区','天津北辰区','天津河北区','天津河西区'," +
			"'天津西青区','天津津南区','天津东丽区','天津武清区','天津宝坻区','天津红桥区','天津大港区','天津汉沽区','天津静海县','天津宁河县','天津塘沽区','天津蓟县'," +
			"'天津南开区','天津河东区','上海松江区','上海宝山区','上海金山区','上海嘉定区','上海南汇区','上海青浦区','上海浦东新区','上海奉贤区','上海闵行区','上海徐汇区', " +
			"'上海静安区','上海黄浦区','上海普陀区','上海杨浦区','上海虹口区','上海闸北区','上海长宁区','上海崇明县','上海卢湾区','重庆江北区','重庆渝北区','重庆沙坪坝区', " +
			"'重庆九龙坡区','重庆万州区','重庆永川市','重庆南岸区','重庆酉阳县','重庆北碚区','重庆涪陵区','重庆秀山县','重庆巴南区','重庆渝中区','重庆石柱县','重庆忠县', " +
			"'重庆合川市','重庆大渡口区','重庆开县','重庆长寿区','重庆荣昌县','重庆云阳县','重庆梁平县','重庆潼南县','重庆江津市','重庆彭水县','重庆璧山县','重庆綦江县'," +
			"'重庆大足县','重庆黔江区','重庆巫溪县','重庆巫山县','重庆垫江县','重庆丰都县','重庆武隆县','重庆万盛区','重庆铜梁县','重庆南川市','重庆奉节县','重庆双桥区'," +
			"'重庆城口县' ,'广州市','中山市','深圳市','惠州市','江门市','珠海市','汕头市','佛山市','湛江市','河源市','肇庆市','潮州市','清远市','韶关市'," +
			"'揭阳市','阳江市','云浮市','东莞市','茂名市','梅州市','汕尾市' ,'石家庄市','河北区','保定市','秦皇岛','唐山市','邯郸市','邢台市','沧州市', " +
			"'承德市','廊坊市','衡水市','张家口' ,'郑州市','洛阳市','焦作市','商丘市','信阳市','新乡市','安阳市','开封市','漯河市','南阳市','鹤壁市'," +
			"'平顶山','濮阳市','许昌市','周口市','三门峡','驻马店','徐州市' ,'昆明市','红河州','大理州','文山州','德宏州','曲靖市','昭通市','楚雄州'," +
			"'保山市','玉溪市','丽江地区','临沧地区','思茅地区','西双版纳州','怒江州','迪庆州' ,'沈阳市','大连市','丹东市','辽阳市','葫芦岛市','锦州市'," +
			"'朝阳市','营口市','鞍山市','抚顺市','阜新市','本溪市','盘锦市','铁岭市' ,'哈尔滨市','齐齐哈尔市','大庆市','佳木斯市','双鸭山市','牡丹江市'," +
			"'鸡西市','黑河市','绥化市','鹤岗市','伊春市','大兴安岭地区','七台河市' ,'长沙市','邵阳市','常德市','衡阳市','株洲市','湘潭市','永州市', " +
			"'岳阳市','怀化市','郴州市','娄底市','益阳市','张家界市','湘西州' ,'合肥市','芜湖市','六安市','宿州市','阜阳市','安庆市','马鞍山市','蚌埠市'," +
			"'淮北市','淮南市','宣城市','黄山市','铜陵市','亳州市','池州市','巢湖市','滁州市' ,'济南市','青岛市','临沂市','济宁市','菏泽市','烟台市'," +
			"'泰安市','淄博市','潍坊市','日照市','威海市','滨州市','东营市','聊城市','德州市','莱芜市','枣庄市' ,'乌鲁木齐市','伊犁州','昌吉州','石河子市'," +
			"'哈密地区','阿克苏地区','巴音郭楞州','喀什地区','塔城地区','克拉玛依市','和田地区','阿勒泰州','吐鲁番地区','阿拉尔市','博尔塔拉州','五家渠市','克孜勒苏州'," +
			"'图木舒克市' ,'南京市','苏州市','徐州市','盐城市','无锡市','南通市','连云港市','常州市','扬州市','镇江市','淮安市','泰州市','宿迁市' ," +
			"'杭州市','温州市','宁波市','台州市','嘉兴市','金华市','湖州市','绍兴市','舟山市','丽水市','衢州市' ,'南昌市','赣州市','上饶市','吉安市'," +
			"'九江市','新余市','抚州市','宜春市','景德镇市','萍乡市','鹰潭市' ,'武汉市','宜昌市','襄樊市','荆州市','恩施州','孝感市','黄冈市','十堰市'," +
			"'咸宁市','黄石市','仙桃市','随州市','天门市','荆门市','潜江市','鄂州市','神农架林区' ,'贵港市','玉林市','北海市','南宁市','柳州市','桂林市'," +
			"'梧州市','钦州市','来宾市','河池市','百色市','贺州市','崇左市','防城港市' ,'兰州市','天水市','庆阳市','武威市','酒泉市','张掖市','陇南地区'," +
			"'白银市','定西地区','平凉市','嘉峪关市','临夏回族自治州','金昌市','甘南州' ,'太原市','大同市','运城市','长治市','晋城市','忻州市','临汾市', " +
			"'吕梁市','晋中市','阳泉市','朔州市' ,'赤峰市','包头市','通辽市','呼和浩特市','乌海市','鄂尔多斯市','呼伦贝尔市','兴安盟','巴彦淖尔盟'," +
			"'乌兰察布盟','锡林郭勒盟','阿拉善盟' ,'西安市','咸阳市','宝鸡市','汉中市','渭南市','安康市','榆林市','商洛市','延安市','铜川市' ,'长春市', " +
			"'吉林市','白山市','白城市','延边州','松原市','辽源市','通化市','四平市' ,'福州市','漳州市','泉州市','厦门市','莆田市','宁德市','三明市', " +
			"'南平市','龙岩市' ,'贵阳市','黔东南州','黔南州','遵义市','黔西南州','毕节地区','铜仁地区','安顺市','六盘水市' ,'西宁市','海西州'," +
			"'海东地区海北州','果洛州','玉树州','黄南藏族自治州','拉萨市','山南地区','林芝地区','日喀则地区','阿里地区','昌都地区','那曲地区'," +
			"'成都市','绵阳市','广元市','达州市','南充市','德阳市','广安市','阿坝州','巴中市','遂宁市','内江市','凉山州','攀枝花市','乐山市','自贡市'," +
			"'泸州市','雅安市','宜宾市','资阳市','眉山市','甘孜州','银川市','吴忠市','中卫市','石嘴山市','固原市','海口市','三亚市','琼海市'," +
			"'文昌市','东方市','昌江县','陵水县','乐东县','五指山市','保亭县','澄迈县','万宁市','儋州市','临高县','白沙县','定安县','琼中县','屯昌县'," +
			"'台北市','高雄市','台中市','新竹市','基隆市','台南市','嘉义市','香港','澳门']}";

	public static List<ContactItemInterface> getSampleContactList()
	{
		List<ContactItemInterface> list = new ArrayList<ContactItemInterface>();

		try
		{
			JSONObject jo1 = new JSONObject(cityJson);

			JSONArray ja1 = jo1.getJSONArray("cities");

			for(int i = 0; i < ja1.length(); i++)
			{
				String cityName = ja1.getString(i);

				list.add(new CityItem(cityName, PinYin.getPinYin(cityName)));
			}
		}
		catch (JSONException e)
		{
			e.printStackTrace();
		}

		return list;
	}

}
